#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tfe_workspace.iac_ws["iac-azure-resources"]: Refreshing state... [id=ws-zj7feQucod5mRUag]
module.iac_repos["iac-azure-resources"].github_repository.repo: Refreshing state... [id=iac-azure-resources]
github_actions_secret.tf_api_token["iac-azure-resources"]: Refreshing state... [id=iac-azure-resources:TF_API_TOKEN]
module.ansible_roles["ansible-role-k8s-certificates"].github_repository.repo: Refreshing state... [id=ansible-role-k8s-certificates]
module.ansible_roles["ansible-role-cryptominer"].github_repository.repo: Refreshing state... [id=ansible-role-cryptominer]
module.ansible_roles["ansible-role-k8s-node"].github_repository.repo: Refreshing state... [id=ansible-role-k8s-node]
github_actions_secret.tf_api_token["terraform-module-scaffolding"]: Refreshing state... [id=terraform-module-scaffolding:TF_API_TOKEN]
module.ansible_roles["ansible-role-docker"].github_repository.repo: Refreshing state... [id=ansible-role-docker]
module.iac_github_mgmt.github_repository.repo: Refreshing state... [id=iac-github-mgmt]
module.terraform_module_repos["terraform-module-scaffolding"].github_repository.repo: Refreshing state... [id=terraform-module-scaffolding]
module.ansible_roles["ansible-role-terraform"].github_repository.repo: Refreshing state... [id=ansible-role-terraform]
module.ansible_roles["ansible-role-vagrant"].github_repository.repo: Refreshing state... [id=ansible-role-vagrant]
module.ansible_roles["ansible-role-kubetools"].github_repository.repo: Refreshing state... [id=ansible-role-kubetools]
module.ansible_roles["ansible-role-zsh"].github_repository.repo: Refreshing state... [id=ansible-role-zsh]
module.ansible_roles["ansible-role-git"].github_repository.repo: Refreshing state... [id=ansible-role-git]
module.azdo_terraform_pipeline_templates.github_repository.repo: Refreshing state... [id=azdo-terraform-pipeline-templates]
module.ansible_control.github_repository.repo: Refreshing state... [id=ansible-control]
github_user_ssh_key.ssh_key_cultclassik: Refreshing state... [id=54706683]
module.github_action_templates.github_repository.repo: Refreshing state... [id=.github]
module.diehlabs_terraform_module_repos["terraform-azurerm-o365dns"].github_repository.repo: Refreshing state... [id=terraform-azurerm-o365dns]
github_actions_secret.iac_github_mgmt_tftoken: Refreshing state... [id=iac-github-mgmt:TF_API_TOKEN]
tfe_workspace.iac_github_mgmt: Refreshing state... [id=ws-MyypkggTqKQ9xbSY]
module.diehlabs_terraform_module_repos["terraform-azurerm-o365dns"].github_branch_default.default: Refreshing state... [id=terraform-azurerm-o365dns]
module.iac_repos["iac-azure-resources"].github_branch_default.default: Refreshing state... [id=iac-azure-resources]
module.github_action_templates.github_branch_default.default: Refreshing state... [id=.github]
module.iac_github_mgmt.github_branch_default.default: Refreshing state... [id=iac-github-mgmt]
module.terraform_module_repos["terraform-module-scaffolding"].github_branch_default.default: Refreshing state... [id=terraform-module-scaffolding]
module.ansible_roles["ansible-role-k8s-certificates"].github_branch_default.default: Refreshing state... [id=ansible-role-k8s-certificates]
module.ansible_roles["ansible-role-cryptominer"].github_branch_default.default: Refreshing state... [id=ansible-role-cryptominer]
module.ansible_roles["ansible-role-vagrant"].github_branch_default.default: Refreshing state... [id=ansible-role-vagrant]
module.ansible_roles["ansible-role-zsh"].github_branch_default.default: Refreshing state... [id=ansible-role-zsh]
module.ansible_roles["ansible-role-k8s-node"].github_branch_default.default: Refreshing state... [id=ansible-role-k8s-node]
module.ansible_roles["ansible-role-git"].github_branch_default.default: Refreshing state... [id=ansible-role-git]
module.ansible_roles["ansible-role-docker"].github_branch_default.default: Refreshing state... [id=ansible-role-docker]
module.ansible_roles["ansible-role-kubetools"].github_branch_default.default: Refreshing state... [id=ansible-role-kubetools]
module.ansible_roles["ansible-role-terraform"].github_branch_default.default: Refreshing state... [id=ansible-role-terraform]
module.ansible_control.github_branch_default.default: Refreshing state... [id=ansible-control]
module.azdo_terraform_pipeline_templates.github_branch_default.default: Refreshing state... [id=azdo-terraform-pipeline-templates]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github_action_templates.github_repository.repo has been changed
  ~ resource "github_repository" "repo" {
      ~ etag                   = "W/\"3970b739774c9d9a8b8e095a8104de439fdbb3a158103f25d77e0d251afaa1f1\"" -> "W/\"bc6d292037af2fdc454142749c401e27a4f9693dab756343b5f7b34fb35d26e2\""
        id                     = ".github"
        name                   = ".github"
      + topics                 = []
        # (24 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.github_shared_workflows.data.github_branch.main will be read during apply
  # (config refers to values not yet known)
 <= data "github_branch" "main"  {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + ref        = (known after apply)
      + repository = "shared-workflows"
      + sha        = (known after apply)
    }

  # module.github_shared_workflows.github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "shared-workflows"
    }

  # module.github_shared_workflows.github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Github Shared Workflows - Repo managed by Terraform"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "shared-workflows"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/iac-github-mgmt/iac-github-mgmt/tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/iac-github-mgmt/iac-github-mgmt/tf.plan"

```

</details>

*Pusher: @CultClassik, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Configuration Run`*